benchmark/results/throughput_mc-vs-rust/RAW/actix_web-plaintext-throughput_mc-run1.txt
Running 30s test @ http://127.0.0.1:8080/plaintext
  8 threads and 256 connections
  Thread calibration: mean lat.: 1.312ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.300ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.302ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.298ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.303ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.295ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.304ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.263ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.33ms    1.59ms  80.83ms   99.10%
    Req/Sec    31.44k     2.75k   67.22k    71.93%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.21ms
 75.000%    1.67ms
 90.000%    2.10ms
 99.000%    2.88ms
 99.900%   14.67ms
 99.990%   72.06ms
 99.999%   79.42ms
100.000%   80.89ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.026     0.000000            1         1.00
       0.528     0.100000       474506         1.11
       0.725     0.200000       946799         1.25
       0.889     0.300000      1418165         1.43
       1.046     0.400000      1893036         1.67
       1.207     0.500000      2364723         2.00
       1.292     0.550000      2599987         2.22
       1.379     0.600000      2835718         2.50
       1.470     0.650000      3073782         2.86
       1.565     0.700000      3308574         3.33
       1.669     0.750000      3546525         4.00
       1.725     0.775000      3664170         4.44
       1.785     0.800000      3781158         5.00
       1.851     0.825000      3899411         5.71
       1.925     0.850000      4018581         6.67
       2.007     0.875000      4136267         8.00
       2.053     0.887500      4195802         8.89
       2.101     0.900000      4253890        10.00
       2.155     0.912500      4313998        11.43
       2.213     0.925000      4371801        13.33
       2.281     0.937500      4431467        16.00
       2.319     0.943750      4461001        17.78
       2.361     0.950000      4490981        20.00
       2.405     0.956250      4519548        22.86
       2.455     0.962500      4549056        26.67
       2.513     0.968750      4578972        32.00
       2.545     0.971875      4593283        35.56
       2.583     0.975000      4608379        40.00
       2.625     0.978125      4623105        45.71
       2.673     0.981250      4637560        53.33
       2.731     0.984375      4652362        64.00
       2.765     0.985938      4659711        71.11
       2.805     0.987500      4667196        80.00
       2.851     0.989062      4674661        91.43
       2.905     0.990625      4681919       106.67
       2.979     0.992188      4689252       128.00
       3.029     0.992969      4692918       142.22
       3.101     0.993750      4696615       160.00
       3.235     0.994531      4700252       182.86
       4.081     0.995313      4703927       213.33
       5.479     0.996094      4707627       256.00
       6.151     0.996484      4709471       284.44
       6.927     0.996875      4711320       320.00
       7.751     0.997266      4713158       365.71
       8.591     0.997656      4715014       426.67
       9.687     0.998047      4716860       512.00
      10.567     0.998242      4717778       568.89
      11.567     0.998437      4718704       640.00
      12.583     0.998633      4719620       731.43
      13.663     0.998828      4720543       853.33
      14.815     0.999023      4721470      1024.00
      15.447     0.999121      4721930      1137.78
      16.311     0.999219      4722390      1280.00
      23.007     0.999316      4722850      1462.86
      30.879     0.999414      4723311      1706.67
      38.911     0.999512      4723773      2048.00
      43.263     0.999561      4724004      2275.56
      47.583     0.999609      4724237      2560.00
      51.551     0.999658      4724465      2925.71
      55.807     0.999707      4724698      3413.33
      60.063     0.999756      4724928      4096.00
      62.047     0.999780      4725043      4551.11
      63.807     0.999805      4725159      5120.00
      65.727     0.999829      4725275      5851.43
      67.903     0.999854      4725393      6826.67
      70.143     0.999878      4725504      8192.00
      71.231     0.999890      4725562      9102.22
      72.127     0.999902      4725619     10240.00
      73.087     0.999915      4725677     11702.86
      73.919     0.999927      4725736     13653.33
      74.815     0.999939      4725794     16384.00
      75.263     0.999945      4725822     18204.44
      75.775     0.999951      4725851     20480.00
      76.287     0.999957      4725880     23405.71
      76.799     0.999963      4725907     27306.67
      77.439     0.999969      4725936     32768.00
      77.823     0.999973      4725954     36408.89
      77.951     0.999976      4725965     40960.00
      78.399     0.999979      4725983     46811.43
      78.591     0.999982      4725996     54613.33
      78.975     0.999985      4726009     65536.00
      79.103     0.999986      4726019     72817.78
      79.231     0.999988      4726024     81920.00
      79.359     0.999989      4726030     93622.86
      79.551     0.999991      4726040    109226.67
      79.615     0.999992      4726045    131072.00
      79.679     0.999993      4726048    145635.56
      79.807     0.999994      4726054    163840.00
      79.871     0.999995      4726057    187245.71
      79.999     0.999995      4726061    218453.33
      80.063     0.999996      4726063    262144.00
      80.127     0.999997      4726066    291271.11
      80.127     0.999997      4726066    327680.00
      80.255     0.999997      4726072    374491.43
      80.255     0.999998      4726072    436906.67
      80.255     0.999998      4726072    524288.00
      80.255     0.999998      4726072    582542.22
      80.511     0.999998      4726073    655360.00
      80.575     0.999999      4726076    748982.86
      80.575     0.999999      4726076    873813.33
      80.575     0.999999      4726076   1048576.00
      80.575     0.999999      4726076   1165084.44
      80.639     0.999999      4726078   1310720.00
      80.639     0.999999      4726078   1497965.71
      80.639     0.999999      4726078   1747626.67
      80.639     1.000000      4726078   2097152.00
      80.639     1.000000      4726078   2330168.89
      80.831     1.000000      4726079   2621440.00
      80.831     1.000000      4726079   2995931.43
      80.831     1.000000      4726079   3495253.33
      80.831     1.000000      4726079   4194304.00
      80.831     1.000000      4726079   4660337.78
      80.895     1.000000      4726080   5242880.00
      80.895     1.000000      4726080          inf
#[Mean    =        1.327, StdDeviation   =        1.591]
#[Max     =       80.832, Total count    =      4726080]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  7100311 requests in 30.00s, 0.86GB read
Requests/sec: 236675.86
Transfer/sec:     29.34MB