benchmark/results/throughput_mc-vs-rust/RAW/actix_web-plaintext-throughput_mc-run2.txt
Running 30s test @ http://127.0.0.1:8080/plaintext
  8 threads and 256 connections
  Thread calibration: mean lat.: 1.270ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.277ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.284ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.357ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.347ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.270ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.356ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.328ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.26ms  624.89us   9.57ms   68.19%
    Req/Sec    31.42k     2.64k   40.89k    70.28%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.19ms
 75.000%    1.65ms
 90.000%    2.09ms
 99.000%    2.80ms
 99.900%    5.19ms
 99.990%    7.46ms
 99.999%    8.69ms
100.000%    9.57ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.026     0.000000            1         1.00
       0.512     0.100000       474296         1.11
       0.706     0.200000       947615         1.25
       0.870     0.300000      1419331         1.43
       1.028     0.400000      1892853         1.67
       1.189     0.500000      2364456         2.00
       1.275     0.550000      2601666         2.22
       1.362     0.600000      2836069         2.50
       1.453     0.650000      3072287         2.86
       1.549     0.700000      3308356         3.33
       1.654     0.750000      3546010         4.00
       1.711     0.775000      3664534         4.44
       1.772     0.800000      3781883         5.00
       1.838     0.825000      3900290         5.71
       1.911     0.850000      4018719         6.67
       1.993     0.875000      4136269         8.00
       2.038     0.887500      4195254         8.89
       2.087     0.900000      4255092        10.00
       2.139     0.912500      4314070        11.43
       2.197     0.925000      4372963        13.33
       2.263     0.937500      4431799        16.00
       2.299     0.943750      4460454        17.78
       2.341     0.950000      4491059        20.00
       2.385     0.956250      4520246        22.86
       2.433     0.962500      4549737        26.67
       2.487     0.968750      4578802        32.00
       2.519     0.971875      4594008        35.56
       2.553     0.975000      4608718        40.00
       2.591     0.978125      4623322        45.71
       2.633     0.981250      4637676        53.33
       2.683     0.984375      4652609        64.00
       2.711     0.985938      4659856        71.11
       2.743     0.987500      4667223        80.00
       2.779     0.989062      4674637        91.43
       2.819     0.990625      4681928       106.67
       2.867     0.992188      4689520       128.00
       2.893     0.992969      4693050       142.22
       2.925     0.993750      4696856       160.00
       2.961     0.994531      4700470       182.86
       3.005     0.995313      4704059       213.33
       3.063     0.996094      4707750       256.00
       3.103     0.996484      4709654       284.44
       3.151     0.996875      4711441       320.00
       3.219     0.997266      4713282       365.71
       3.377     0.997656      4715131       426.67
       3.759     0.998047      4716970       512.00
       4.027     0.998242      4717895       568.89
       4.287     0.998437      4718824       640.00
       4.563     0.998633      4719739       731.43
       4.899     0.998828      4720662       853.33
       5.235     0.999023      4721590      1024.00
       5.387     0.999121      4722049      1137.78
       5.551     0.999219      4722509      1280.00
       5.731     0.999316      4722971      1462.86
       5.927     0.999414      4723429      1706.67
       6.143     0.999512      4723895      2048.00
       6.251     0.999561      4724126      2275.56
       6.371     0.999609      4724352      2560.00
       6.495     0.999658      4724585      2925.71
       6.635     0.999707      4724814      3413.33
       6.779     0.999756      4725052      4096.00
       6.859     0.999780      4725162      4551.11
       6.943     0.999805      4725275      5120.00
       7.055     0.999829      4725395      5851.43
       7.179     0.999854      4725506      6826.67
       7.323     0.999878      4725624      8192.00
       7.399     0.999890      4725680      9102.22
       7.479     0.999902      4725739     10240.00
       7.579     0.999915      4725797     11702.86
       7.667     0.999927      4725856     13653.33
       7.767     0.999939      4725910     16384.00
       7.823     0.999945      4725940     18204.44
       7.855     0.999951      4725968     20480.00
       7.931     0.999957      4725997     23405.71
       8.031     0.999963      4726025     27306.67
       8.163     0.999969      4726054     32768.00
       8.239     0.999973      4726071     36408.89
       8.287     0.999976      4726085     40960.00
       8.327     0.999979      4726098     46811.43
       8.391     0.999982      4726112     54613.33
       8.487     0.999985      4726127     65536.00
       8.519     0.999986      4726134     72817.78
       8.591     0.999988      4726142     81920.00
       8.655     0.999989      4726148     93622.86
       8.719     0.999991      4726155    109226.67
       8.823     0.999992      4726162    131072.00
       8.839     0.999993      4726166    145635.56
       8.863     0.999994      4726170    163840.00
       8.903     0.999995      4726174    187245.71
       8.983     0.999995      4726179    218453.33
       9.023     0.999996      4726180    262144.00
       9.039     0.999997      4726182    291271.11
       9.055     0.999997      4726184    327680.00
       9.087     0.999997      4726186    374491.43
       9.135     0.999998      4726189    436906.67
       9.135     0.999998      4726189    524288.00
       9.167     0.999998      4726190    582542.22
       9.231     0.999998      4726191    655360.00
       9.247     0.999999      4726192    748982.86
       9.287     0.999999      4726193    873813.33
       9.351     0.999999      4726194   1048576.00
       9.351     0.999999      4726194   1165084.44
       9.447     0.999999      4726195   1310720.00
       9.447     0.999999      4726195   1497965.71
       9.503     0.999999      4726196   1747626.67
       9.503     1.000000      4726196   2097152.00
       9.503     1.000000      4726196   2330168.89
       9.551     1.000000      4726197   2621440.00
       9.551     1.000000      4726197   2995931.43
       9.551     1.000000      4726197   3495253.33
       9.551     1.000000      4726197   4194304.00
       9.551     1.000000      4726197   4660337.78
       9.575     1.000000      4726198   5242880.00
       9.575     1.000000      4726198          inf
#[Mean    =        1.259, StdDeviation   =        0.625]
#[Max     =        9.568, Total count    =      4726198]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  7127897 requests in 30.00s, 0.86GB read
Requests/sec: 237599.90
Transfer/sec:     29.46MB